#-------------------------------------------------------------------------------------------------------------------------------------
c1 = ['лада','ауди','бмв','черри','форд','хавал','хонда','киа','лексус','мазда','ниссан','опель','рено','шкода','вольво','мерседес',
      'тойота','бентли','джилли','чанган','пежо','ситроен','судзуки','хендай','фиат','фав','джип','тесла','порше','фольксваген']
c2 = ['найк','эпл','сони','принглс','яндекс','гугл','пепси','сбер','аэрофлот','никон','пума','диор','адидас','марвел','данон','шанель']
c3 = ['москва','дедовск','химки','саратов','махачкала','брянск','тамбов','перьмь','рязань','владимир','волгоград','питер','клин','тула'
      'тверь','магадан','новосибирск','вологда','уфа','кострома','краснодар','ростов','красноярск','элиста','грозный','дербент']
c4 = ['клен','дуб','ясень','береза','ель','сосна','пихта','акация','баобаб','венге','ива','каштан','кедр','маслина','ольха','пальма']
c5 = ['слон','собака','лев','тигр','бегемот','жираф','зебра','зубр','пингвин','фламинго','пчела','бабочка','шмель','муравей','ежик']
c6 = ['трава','ель','краска','листья','водоросли','сельдерей','шпинат','жаба','деньги','газон','лягушка','изумруд','крокодил']
c7 = ['молоток','отвертка','дрель','перфоратор','топор','пила','стамеска','лопата','болгарка','пассатижи','кусачки','уровень']
c8 = ['дворовая','шотландец','британская','сиамская','персидская','рэгдолл','турецкая','манчкин','бурмилла','гавана','бамбино']
c9 = ['поп','джаз','рок','альтернатива','ретро','шансон','кантри','блюз','диско','авангард','балет','хор','симфония','металл']
c10 = ['пиво','сок','вино','ликер','смузи','компот','морс','чай','кофе','коньяк','виски','водка','квас','кумыс','кисель','чача']
c11 = ['байкал','онежское','ладожское','таймыр','ханка','чаны','топозер','белое','сегозеро','хантайское','лабаз','красное']
c12 = ['бухгалтер','инженер','водитель','охранник','учитель','испытатель','машинист','врач','певец','пожарный','полицейский',
       'строитель','техник','электрик','сантехник','механик','шахтер','тренер','продавец','машинист','химик','вахтер','депутат']
c13 = ['семга','селедка','дорадо','килька','сайра','щука','язь','тарань','барабулька','сазан','сом','белуга','лосось','кета','осетр']
c14 = ['бег','футбол','хоккей','лыжи','велогонки','бокс','атлетика','плавание','волейбол','биатлон','фехтование','борьба','самбо']
c15 = ['русский','английский','французский','польский','украинский','белорусский','казахский','болгарский','шумерский','сербский',
       'немецкий','японский','китайский','итальянский','иврит','испанский','арабский','турецкий','вьетнамский','персидский']
#-------------------------------------------------------------------------------------------------------------------------------------
mix = ['лада','ауди','бмв','черри','форд','хавал','хонда','киа','лексус','мазда',
       'ниссан','опель','рено','шкода','вольво','мерседес','найк','эпл','сони','принглс',
       'яндекс','гугл','пепси','сбер','аэрофлот','никон','пума','диор','адидас','марвел',
       'данон','чудо','москва','дедовск','химки','саратов','махачкала','брянск','тамбов',
       'перьмь','рязань','владимир','волгоград','питер','клин','тула','клен','дуб','ясень',
       'береза','ель','сосна','пихта','акация','баобаб','венге','ива','каштан','кедр',
       'маслина','ольха','пальма','слон','собака','лев','тигр','бегемот','жираф','зебра',
       'зубр','пингвин','фламинго','пчела','бабочка','шмель','муравей','ежик','трава','ель',
       'краска','листья','водоросли','сельдерей','шпинат','щавель','деньги','газон','лягушка',
       'изумруд','крокодил','молоток','отвертка','дрель','перфоратор','топор','пила','стамеска',
       'лопата','болгарка','пассатижи','кусачки','уровень','дворовая','шотландец','британская',
       'сиамская','персидская','рэгдолл','турецкая','манчкин','бурмилла','гавана','бамбино','поп',
       'джаз','рок','альтернатива','ретро','шансон','кантри','блюз','диско','авангард','балет',
       'хор','симфония','металл','пиво','сок','вино','ликер','смузи','компот','морс','чай','кофе',
       'коньяк','виски','водка','квас','кумыс','кисель','чача','байкал','онежское','ладожское',
       'таймыр','ханка','чаны','топозер','белое','сегозеро','хантайское','лабаз','красное','бухгалтер',
       'инженер','водитель','охранник','учитель','испытатель','машинист','врач','хирург','пожарный',
       'полицейский','семга','селедка','дорадо','килька','сайра','щука','язь','тарань','барабулька',
       'сазан','сом','белуга','лосось','кета','осетр','бег','футбол','хоккей','лыжи','велогонки','бокс',
       'атлетика','плавание','волейбол','биатлон','фехтование','борьба','самбо','русский','английский',
       'французский','польский','украинский','белорусский','казахский','болгарский','шумерский','сербский',
       'книга','стол','столб','мышь','стакан','кружка','кресло','диван','ручка','карандаш','телефон','нож',
       'смартфон','экран','монитор','блокнот','тетрадь','сушилка','белье','плед','подушка','кровать','носки',
       'бутылка','розетка','одеяло','салфетка','картошка','банан','клубника','кот','персик','груша','киви',
       'шкаф','куртка','штаны','футболка','веник','окно','крем','лекарства','сумка','кран','вилка','тарелка',
       'подставка','тряпка','ванна','стиралка','машина','велосипед','конь','муха','вертолет','двигатель',
       'следователь','директор','начальник','техник','работа','задача','дагестан','дорога','кролик','аналитик',
       'автомобиль','алкоголь','авиация','аналитика','ансамбль','африка','алгебра','бревно','барсук','боулинг',
       'батискаф','балтика','баррикада','бочка','вилка','виноград','винтаж','вена','ватикан','вера','верфь',
       'город','горсть','гондола','грабли','гавань','грядка','гриль','дом','диск','долг','должность','дипломат',
       'диковинка','драник','енот','егерь','единство','единорог','ежевика','емкость','ерунда','желтый','жидкость',
       'желатин','жажда','журавль','жара','жадность','зима','зеркало','зависть','змея','зуд','зверь','зной',
       'иголка','икота','ипотека','инвестиция','ископаемое','история','игра','йод','йога','йогурт','колготки',
       'квартира','квитанция','корреляция','кафе','кино','концерт','ложка','лужа','лицемер','лента','ласточка',
       'любовь','листок','морозилка','медведь','морж','медовик','мед','морковь','магнит','неаполь','нос','норильск',
       'наказание','насекомое','новости','наглость','опасность','остров','оренбург','ореол','орео','окантовка',
       'очки','пропуск','педаль','передача','помощь','поломка','пластырь','пенал','рюкзак','роман','ресторан',
       'режиссер','редактор','ром','разлука','стена','сожитель','судья','статья','связка','судьба','символ',
       'туфли','табурет','тройка','тромб','тагил','трезубец','трамвай','урок','уход','утка','улов','удочка',
       'урал','учебник','фотография','финал','фильм','фтор','фосфор','файл','фальцет','хлеб','херсон','хамство',
       'храбрость','хитрость','хирург','художник','цапля','царь','ценник','цикл','цирк','цвет','церковь','чайник',
       'чашка','человек','чехия','чикаго','чучело','чудо','швабра','шершень','шило','шахта','шина','шалость',
       'шкала','щенок','щегол','щель','щавель','щит','щетка','щупальце','электричество','экономика','электрон',
       'электрод','эквивалент','эквилибрист','энергия','юбка','юла','юность','юрист','юбилей','юпитер','ювелир',
       'ягода','яблоко','явства','язва','янтарь','ярмарка','ядро']
#-------------------------------------------------------------------------------------------------------------------------------------
from random import *
from time import *
#-------------------------------------------------------------------------------------------------------------------------------------
step = 0
trial = 0
mode = ''
categories = 0
target = ''
stage_print = -1
exception = [2,3,4]
trying = ['Здесь будут указываться верные буквы']
#-------------------------------------------------------------------------------------------------------------------------------------
stage = [       '''
                   --------
                   |      |
                   |
                   |
                   |
                   |
                  ---
                ''',
                '''
                   --------
                   |      |
                   |      O
                   |
                   |
                   |
                  ---
                ''',
                '''
                   --------
                   |      |
                   |      O
                   |      |
                   |      |
                   |
                  ---
                ''',
                '''
                   --------
                   |      |
                   |      O
                   |     \|
                   |      |
                   |
                  ---
                ''',
                '''
                   --------
                   |      |
                   |      O
                   |     \|/
                   |      |
                   |
                  ---
                ''',
                '''
                   --------
                   |      |
                   |      O
                   |     \|/
                   |      |
                   |     / 
                  ---
                ''',
                '''
                   --------
                   |      |
                   |      O
                   |     \|/
                   |      |
                   |     / \ 
                  ---
                ''']
#-------------------------------------------------------------------------------------------------------------------------------------
print()
print('Включение...',' ',sep='\n')
sleep(1)
print('Программа "guessing" активирована',' ','Коротко о программе',' ',
      'Программа "guessing" это игра в угадайку','Программа загадает случайное слово из выбранной вами категории и сообщит вам его длину',
      'Пользуясь знанием длины слова и категории к которой оно относится, вы должны его отгадать','На отгадывание вам даётся несколько попыток',
      'Каждая провальная поптыка будет завершать рисунок, его завершение будет означать ваше поражение и конец игры',' ',
      'Для запуска введите "Да", или "Старт"',
      'Любой другой ввод, остановит работу программы',' ',sep='\n')
#-------------------------------------------------------------------------------------------------------------------------------------
def step_changer(begin):
    global step
    global mode
    if step == 0:
        if begin.isalpha():
            if begin.lower() == 'да' or begin.lower() == 'старт':
                step = 1
                return True
            else:
                print()
                print('Выключение...',' ',sep='\n')
                return False
        else:
            print()
            print('Выключение...',' ',sep='\n')
            return False
    elif step == 2:
        if choice.isalpha():
            if choice.lower() == 'а' or choice.lower() == 'б':
                if choice.lower() == 'а':
                    mode = 'word'
                    x = 'Разгадка слова целиком'
                elif choice.lower() == 'б':
                    mode = 'letter'
                    x = 'Разгадка слова по буквам'
                print()
                print('Выбран режим игры -',x)
                step = 3
                return True
            else:
                print('Некорректный ввод, повторите попытку',' ',sep='\n')
                return False
        else:
            print('Некорректный ввод, повторите попытку',' ',sep='\n')
            return False
#-------------------------------------------------------------------------------------------------------------------------------------
def choice_cat(choice):
    global categories
    if choice.isdigit():
        if int(choice) == 1:
            categories = c1
            print('Выбрана категория: 1. Автомобили (марки)')
            return True
        elif int(choice) == 2:
            categories = c2
            print('Выбрана категория: 2. Бренды')
            return True
        elif int(choice) == 3:
            categories = c3
            print('Выбрана категория: 3. Города (России)')
            return True
        elif int(choice) == 4:
            categories = c4
            print('Выбрана категория: 4. Деревья')
            return True
        elif int(choice) == 5:
            categories = c5
            print('Выбрана категория: 5. Живность (разная)')
            return True
        elif int(choice) == 6:
            categories = c6
            print('Выбрана категория: 6. Зеленый цвет')
            return True
        elif int(choice) == 7:
            categories = c7
            print('Выбрана категория: 7. Инструменты')
            return True
        elif int(choice) == 8:
            categories = c8
            print('Выбрана категория: 8. Котики (породы)')
            return True
        elif int(choice) == 9:
            categories = c9
            print('Выбрана категория: 9. Музыка (стили)')
            return True
        elif int(choice) == 10:
            categories = c10
            print('Выбрана категория: 10. Напитки')
            return True
        elif int(choice) == 11:
            categories = c11
            print('Выбрана категория: 11. Озера')
            return True
        elif int(choice) == 12:
            categories = c12
            print('Выбрана категория: 12. Профессии')
            return True
        elif int(choice) == 13:
            categories = c13
            print('Выбрана категория: 13. Рыбы')
            return True
        elif int(choice) == 14:
            categories = c14
            print('Выбрана категория: 14. Спорт')
            return True
        elif int(choice) == 15:
            categories = c15
            print('Выбрана категория: 15. Языки мира')
            return True
        elif int(choice) == 16:
            categories = mix
            print('Выбрана категория: 16. Случайное слово из общего набора')
            return True
        elif int(choice) == 17:
            print()
            print('Выберите букву из русского алфавита','Недоступные буквы: ё/ъ/ы/ь',' ',sep='\n')
            letter = input('Выберите букву: ' )
            print()
            x = []
            for i in range(len(mix)):
                y = mix[i]
                z = y[0]
                if z == letter:
                    x.append(y)
            categories = x
            print('Выбрана категория: 17. Слово на букву -',letter)
            return True
        else:
            print()
            print('Некорректный ввод, повторите попытку',' ',sep='\n')
            return False
    else:
        print()
        print('Некорректный ввод, повторите попытку',' ',sep='\n')
        return False
#-------------------------------------------------------------------------------------------------------------------------------------
def the_game_A(ans):
    global trying
    global stage_print 
    global trial
    if ans.isalpha():
        if ans.lower() == target:
            print()
            print('Вы угадали!')
            print('Верное слово -',target,'!')
            print()
            print('Количество попыток:',trial+1)
            step4()
        elif ans.lower() != target:
            word = 'раз'
            how = 0
            let = ''
            for i in range(len(ans)):
                letter = ans[i]
                if letter in target:
                    if letter not in let:
                        let = let + letter + ' '
                        how += 1
            trial += 1
            stage_print += 1
            print(stage[int(stage_print)])
            print() 
            print('Неверное слово')
            if how in exception:
                word = 'раза'
            print('Верные буквы встречаются :',how,word)
            print('Верные буквы :',let)
            print()
            if trial < 7:
                ans = input('Вводите :')
                chek = the_game_A(ans)
            else:
                step4()
    else:
        print()
        print('Некорректный ввод')
        print()
        ans = input('Вводите :')
        chek = the_game_A(ans)
#-------------------------------------------------------------------------------------------------------------------------------------
def the_game_B(ans):
    global trying
    global stage_print
    global trial
    if ans.isalpha():
        if ans.lower() == target:
            print()
            print('Вы угадали!')
            print('Верное слово -',target,'!')
            print()
            print('Количество попыток:',trial+1)
            step4()
        elif ans.lower() != target:
            word = 'раз'
            how = 0
            for i in range(len(ans)):
                letter = ans[i]
                if letter in target:
                    for j in range(len(target)):
                        if letter == target[j]:
                            trying[j] = letter.upper()
                    if letter not in trying:
                        how += 1
            trial += 1
            stage_print += 1
            print(stage[int(stage_print)])
            print() 
            print('Неверное слово')
            if how in exception:
                word = 'раза'
            print('Верные буквы встречаются :',how,word)
            print(trying)
            print()
            if trial < 7:
                ans = input('Вводите :')
                chek = the_game_B(ans)
            else:
                step4()
    else:
        print()
        print('Некорректный ввод',' ',sep='\n')
        ans = input('Вводите :')
        chek = the_game_B(ans)
#-------------------------------------------------------------------------------------------------------------------------------------
def step1():
    global begin
    begin = input('Вводите : ')
    chek = step_changer(begin)
    if chek == True:
        step2()
#-------------------------------------------------------------------------------------------------------------------------------------
def step2():
    global step
    global choice
    print()
    sleep(0.4)
    print('Запуск...')
    sleep(0.4)
    print('Подготовка систем к работе...')
    sleep(0.4)
    print('Все системы активированы...',' ',sep='\n')
    sleep(0.4)
    print('Вас приветствует "Игра в Угадайку"','Игра имеет несколько режимов на выбор пользователя :',' ',
          'А - Разгадка слова целиком',' ','Б - Разгадка слова по буквам',' ','Сделайте выбор и введите "А" или "Б"',' ',sep='\n')
    step = 2
    choice = input('Вводите : ')
    chek = step_changer(choice)
    while chek != True:
        choice = input('Вводите : ')
        chek = step_changer(choice)
    if chek == True:
        step3()
#-------------------------------------------------------------------------------------------------------------------------------------
def step2_1():
    global step
    global choice
    print()
    sleep(0.4)
    print('Подготовка систем к работе...')
    sleep(0.4)
    print('Подготовка завершена...',' ',sep='\n')
    sleep(0.4)
    print('Выберите режим:',' ',
          'А - Разгадка слова целиком',' ','Б - Разгадка слова по буквам',' ','Введите "А" или "Б"',' ',sep='\n')
    step = 2
    choice = input('Вводите : ')
    chek = step_changer(choice)
    while chek != True:
        choice = input('Вводите : ')
        chek = step_changer(choice)
    if chek == True:
        step3()
#-------------------------------------------------------------------------------------------------------------------------------------
def step3():
    global choice
    global trying
    global target
    print()
    print('Для более удобной и приятной игры, предусмотрены категории','','На выбор доступны слудующие категории :',
          '1. Автомобили (марки)','2. Бренды','3. Города (России)','4. Деревья','5. Живность (разная)',
          '6. Зеленый цвет','7. Инструменты (рабочие)','8. Котики (породы)','9. Музыка (стили)','10. Напитки',
          '11. Озера','12. Профессии','13. Рыбы','14. Спорт','15. Языки мира',' ',
          '16. Случайное слово из общего набора',' ','17. Слово на выбранную вами букву',' ',
          '"Для выбора, введите номер понравившейся категории "',' ',sep='\n')
    choice = input('Вводите : ')
    chek = choice_cat(choice)
    while chek != True:
        choice = input('Вводите : ')
        chek = choice_cat(choice)
    x = len(categories)
    y = randint(0,x-1)
    target = categories[y]
    print()
    print('Подготовка завершена',trying,' ','Игра началась!',sep='\n')
    print('Длина слова:',len(target))
    print()
    trying = []
    for i in range(len(target)):
        trying.append(chr(95))
    if mode == 'word':
        ans = input('Вводите :')
        chek = the_game_A(ans)
    elif mode == 'letter':
        ans = input('Вводите :')
        chek = the_game_B(ans)
#-------------------------------------------------------------------------------------------------------------------------------------
def step4():
    global step
    global trial
    global stage_print
    global trying
    if trial >= 7:
        print('Количество попыток исчерпано, вы проиграли...',' ',sep='\n')
        print('Загаданное слово :',target)
    print('','','','','',sep='\n')
    print('Желаете сыграть еще раз?','Введите "Да" или "Нет"',' ',sep='\n')
    step = 0
    trial = 0
    stage_print = -1
    trying = ['Здесь будут указываться верные буквы']
    begin = input('Вводите : ')
    chek = step_changer(begin)
    if chek == True:
        step2_1()
#-------------------------------------------------------------------------------------------------------------------------------------
step1()
#-------------------------------------------------------------------------------------------------------------------------------------